CHaerem/Glance/esp32-client/src/main.cpp
#include "EPD_13in3e.h"
#include "GUI_Paint.h"
#include "fonts.h"
#include <WiFi.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include "soc/rtc_cntl_reg.h"
#include "esp32-hal-cpu.h"
#include "esp_sleep.h"
#include "esp_task_wdt.h"

// Configuration constants
#define API_BASE_URL "http://serverpi.local:3000/api/"
#define STATUS_URL "http://serverpi.local:3000/api/device-status"
#define MIN_SLEEP_TIME 300000000ULL      // 5 minutes
#define MAX_SLEEP_TIME 4294967295ULL     // Max value for 32-bit unsigned long (about 71 minutes)
#define DEFAULT_SLEEP_TIME 3600000000ULL // 1 hour
#define BATTERY_PIN A13
#define LOW_BATTERY_THRESHOLD 3.3
#define DEVICE_ID "esp32-001"
#define FIRMWARE_VERSION "1.1.0"

// Enhanced communication constants
#define MAX_RETRY_ATTEMPTS 3
#define BASE_TIMEOUT 5000
#define MAX_TIMEOUT 15000
#define OFFLINE_BUFFER_SIZE 10
#define HEARTBEAT_INTERVAL 30000  // 30 seconds when staying awake
#define CONNECTION_CHECK_INTERVAL 5000  // 5 seconds

// Serial streaming constants
#define SERIAL_STREAM_BUFFER_SIZE 1024
#define SERIAL_STREAM_INTERVAL 10000  // Stream every 10 seconds when awake
#define SERIAL_STREAM_MIN_CHARS 50    // Minimum characters before streaming

// Communication state tracking
struct CommState {
    unsigned long lastSuccessfulContact = 0;
    unsigned long lastHeartbeat = 0;
    int consecutiveFailures = 0;
    bool serverReachable = false;
    int adaptiveTimeout = BASE_TIMEOUT;
};

// Offline buffer for logs and status updates
struct BufferedMessage {
    String endpoint;
    String payload;
    unsigned long timestamp;
    int retryCount;
};

// Serial streaming state
struct SerialStreamState {
    String buffer;
    unsigned long lastStreamTime = 0;
    boolean isStreaming = false;
    boolean streamingEnabled = false;
};

// Global state
CommState commState;
BufferedMessage offlineBuffer[OFFLINE_BUFFER_SIZE];
int bufferHead = 0;
int bufferCount = 0;
SerialStreamState serialStream;

// Simple base64 decoder
String base64_decode(String input)
{
    const char *chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
    String output = "";

    // Remove any padding
    while (input.endsWith("="))
    {
        input.remove(input.length() - 1);
    }

    for (int i = 0; i < input.length(); i += 4)
    {
        unsigned long combined = 0;
        int chars_count = 0;

        // Process 4 characters at a time
        for (int j = 0; j < 4 && (i + j) < input.length(); j++)
        {
            char c = input.charAt(i + j);
            int val = 0;

            // Find character in base64 alphabet
            for (int k = 0; k < 64; k++)
            {
                if (chars[k] == c)
                {
                    val = k;
                    break;
                }
            }

            combined = (combined << 6) | val;
            chars_count++;
        }

        // Extract bytes
        if (chars_count >= 2)
        {
            output += (char)((combined >> 16) & 0xFF);
        }
        if (chars_count >= 3)
        {
            output += (char)((combined >> 8) & 0xFF);
        }
        if (chars_count >= 4)
        {
            output += (char)(combined & 0xFF);
        }
    }

    return output;
}

// Global variables for power management
RTC_DATA_ATTR int bootCount = 0;
RTC_DATA_ATTR uint64_t lastSleepDuration = DEFAULT_SLEEP_TIME;

// Function declarations
void setupPowerManagement();
bool connectToWiFi();
bool fetchCurrentImage();
void reportDeviceStatus(const char *status, float batteryVoltage, int signalStrength);
void sendLogToServer(const char *message, const char *level = "INFO");
void displayImageFromData(const uint8_t *imageData, int width, int height);
void displayTextMessage(const String &text);
void enterDeepSleep(uint64_t sleepTime);
float readBatteryVoltage();
bool checkForCommands();
void processCommand(const String &command, unsigned long duration);

// Enhanced communication functions
bool makeHttpRequest(const String &url, const String &method, const String &payload, String &response, int customTimeout = 0);
void bufferMessage(const String &endpoint, const String &payload);
void flushOfflineBuffer();
void updateCommState(bool success);
void sendHeartbeat();
bool isServerReachable();
void adaptiveDelay(int baseDelay);

// Serial streaming functions
void enableSerialStreaming();
void disableSerialStreaming();
void captureSerialOutput(const String &output);
void flushSerialStream();
size_t debugWrite(const uint8_t *buffer, size_t size);

void setup()
{
    Serial.begin(115200);
    delay(1000);

    // Increment boot number and print it every reboot
    ++bootCount;
    Debug("Boot number: " + String(bootCount) + "\r\n");

    // Setup power management first
    setupPowerManagement();

    Debug("Glance ESP32 Client Starting...\r\n");
    Debug("Device ID: ");
    Debug(DEVICE_ID);
    Debug("\r\n");
    Debug("Firmware Version: ");
    Debug(FIRMWARE_VERSION);
    Debug("\r\n");

    // Read battery voltage
    float batteryVoltage = readBatteryVoltage();
    Debug("Battery Voltage: " + String(batteryVoltage) + "V\r\n");

    // Check if we need to skip this cycle due to low battery
    if (batteryVoltage < LOW_BATTERY_THRESHOLD)
    {
        Debug("Low battery detected, entering extended sleep\r\n");
        sendLogToServer("Low battery - entering extended sleep", "WARN");
        enterDeepSleep(MAX_SLEEP_TIME); // Sleep for maximum time to conserve power
        return;
    }

    // Connect to WiFi
    if (!connectToWiFi())
    {
        Debug("WiFi connection failed, entering sleep\r\n");
        sendLogToServer("WiFi connection failed", "ERROR");
        enterDeepSleep(MIN_SLEEP_TIME); // Retry sooner on WiFi failure
        return;
    }

    // Report initial status
    int signalStrength = WiFi.RSSI();
    reportDeviceStatus("awake", batteryVoltage, signalStrength);
    sendLogToServer("Device awakened, checking for updates");

