CHaerem/Glance/esp32-client/src/main.cpp
    // Initialize e-Paper display
    Debug("Initializing e-Paper display...\r\n");
    DEV_Module_Init();
    delay(2000);

    EPD_13IN3E_Init();
    delay(2000);

    // Check for pending commands first
    esp_task_wdt_reset();
    checkForCommands();

    // Fetch and display current image
    esp_task_wdt_reset();
    bool imageUpdated = fetchCurrentImage();

    if (imageUpdated)
    {
        reportDeviceStatus("display_updated", batteryVoltage, signalStrength);
        sendLogToServer("Display updated successfully");
    }
    else
    {
        reportDeviceStatus("no_update", batteryVoltage, signalStrength);
        sendLogToServer("No display update needed");
    }

    // Power down display
    EPD_13IN3E_Sleep();

    // Check for commands again before sleeping
    bool shouldStayAwake = checkForCommands();

    if (shouldStayAwake)
    {
        reportDeviceStatus("staying_awake", batteryVoltage, signalStrength);
        sendLogToServer("Staying awake for remote commands");
        
        // Enable serial streaming while awake
        enableSerialStreaming();
        
        // Stay awake for up to 5 minutes, checking for commands every 30 seconds
        unsigned long stayAwakeStart = millis();
        unsigned long stayAwakeTimeout = 5 * 60 * 1000; // 5 minutes
        
        while (millis() - stayAwakeStart < stayAwakeTimeout)
        {
            // Send heartbeat to maintain connection
            sendHeartbeat();
            
            // Wait between heartbeats, but check for commands more frequently
            unsigned long heartbeatStart = millis();
            while (millis() - heartbeatStart < HEARTBEAT_INTERVAL && 
                   millis() - stayAwakeStart < stayAwakeTimeout)
            {
                delay(CONNECTION_CHECK_INTERVAL); // Check every 5 seconds
                esp_task_wdt_reset(); // Reset watchdog during stay awake period
                
                // Check for new commands
                if (checkForCommands())
                {
                    // New commands received, continue staying awake
                    stayAwakeStart = millis(); // Reset stay awake timer
                }
            }
            
            // If we haven't received commands for a while, check server reachability
            if (!isServerReachable())
            {
                Debug("Server unreachable, ending stay awake period\r\n");
                sendLogToServer("Ending stay awake - server unreachable", "WARN");
                break;
            }
        }
        
        // Disable serial streaming before sleeping
        disableSerialStreaming();
    }

    // Report going to sleep
    reportDeviceStatus("sleeping", batteryVoltage, signalStrength);
    String sleepMessage = "Entering deep sleep for " + String(lastSleepDuration / 1000000) + " seconds";
    sendLogToServer(sleepMessage.c_str());

    // Enter deep sleep
    enterDeepSleep(lastSleepDuration);
}

void loop()
{
    // This should never be reached due to deep sleep
    delay(1000);
}

void setupPowerManagement()
{
    Debug("Setting up power management...\r\n");

    // Set CPU frequency to 80MHz for power efficiency
    setCpuFrequencyMhz(80);
    Debug("CPU frequency set to 80MHz\r\n");

    // Disable brownout detector for battery operation
    WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);
    Debug("Brownout detector disabled\r\n");

    // Configure watchdog timer (300 seconds = 5 minutes)
    esp_task_wdt_init(300, true);
    esp_task_wdt_add(NULL);
    Debug("Watchdog timer configured (300s)\r\n");

    // Configure wake-up source
    esp_sleep_enable_timer_wakeup(DEFAULT_SLEEP_TIME);
}

bool connectToWiFi()
{
    Debug("Connecting to WiFi: " WIFI_SSID "\r\n");

    // Try WiFi connection with multiple attempts
    for (int retry = 0; retry < 3; retry++)
    {
        WiFi.mode(WIFI_STA);
        WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 20)
        {
            delay(500);
            Debug(".");
            attempts++;
            
            // Feed watchdog during long operations
            esp_task_wdt_reset();
        }

        if (WiFi.status() == WL_CONNECTED)
        {
            Debug("\r\nWiFi connected!\r\n");
            Debug("IP address: " + WiFi.localIP().toString() + "\r\n");
            Debug("Signal strength: " + String(WiFi.RSSI()) + " dBm\r\n");
            return true;
        }
        
        Debug("\r\nWiFi connection attempt " + String(retry + 1) + " failed\r\n");
        
        if (retry < 2)
        {
            WiFi.disconnect();
            delay(2000); // Wait before retry
        }
    }
    
    Debug("WiFi connection failed after 3 attempts!\r\n");
    return false;
}

bool fetchCurrentImage()
{
    Debug("Fetching current image from server...\r\n");

    HTTPClient http;
    http.begin(API_BASE_URL "current.json");
    http.setTimeout(15000); // 15 second timeout for image downloads
    http.addHeader("User-Agent", "ESP32-Glance-Client/" FIRMWARE_VERSION);

    int httpResponseCode = http.GET();

    if (httpResponseCode == 200)
    {
        String payload = http.getString();
        Debug("Server response received\r\n");

        // Parse JSON response
        DynamicJsonDocument doc(8192);
        deserializeJson(doc, payload);

        String title = doc["title"];
        String imageBase64 = doc["image"];
        uint64_t sleepDuration = doc["sleepDuration"];

        Debug("Title: " + title + "\r\n");
        Debug("Sleep duration: " + String(sleepDuration / 1000000) + " seconds\r\n");

        // Update sleep duration for next cycle
        lastSleepDuration = (sleepDuration > 0) ? sleepDuration : DEFAULT_SLEEP_TIME;

        if (imageBase64.length() > 0)
        {
            Debug("Processing image data...\r\n");

            // Decode base64 image
            String decoded = base64_decode(imageBase64);

            if (decoded.length() > 0)
            {
                Debug("Data decoded successfully\r\n");

                // Clear display first
                EPD_13IN3E_Clear(EPD_13IN3E_WHITE);
                delay(3000);

                // Check if this looks like image data or text data
                if (decoded.length() == (1150 * 1550))
                {
                    // This looks like raw image data for the display
                    Debug("Processing as image data\r\n");
                    displayImageFromData((const uint8_t *)decoded.c_str(), 1150, 1550);
                }
                else
                {
                    // This looks like text data
                    Debug("Processing as text data\r\n");
                    displayTextMessage(decoded);
                }

                http.end();
                return true;
            }
            else
            {
                Debug("Failed to decode image data\r\n");
            }
        }
        else
        {
            Debug("No image data in response\r\n");
            // Still clear the display to show we're working
            EPD_13IN3E_Clear(EPD_13IN3E_WHITE);
            delay(2000);
        }
    }
    else
    {
        Debug("HTTP Error: " + String(httpResponseCode) + "\r\n");
    }

    http.end();
    return false;
}

void displayImageFromData(const uint8_t *imageData, int width, int height)
{
    Debug("Displaying image: " + String(width) + "x" + String(height) + "\r\n");

    // Calculate centering
    UWORD x_offset = (EPD_13IN3E_WIDTH - width) / 2;
    UWORD y_offset = (EPD_13IN3E_HEIGHT - height) / 2;

    // Display the image
    EPD_13IN3E_DisplayPart(imageData, x_offset, y_offset, width, height);

    Debug("Image display completed\r\n");
}

void displayTextMessage(const String &text)
{
    Debug("Displaying text message: " + text + "\r\n");

