CHaerem/Glance/esp32-client/src/main.cpp
    // Create a simple text display
    // For now, just clear the screen and show we got the message
    EPD_13IN3E_Clear(EPD_13IN3E_WHITE);
    delay(2000);

    // You can implement text rendering here if needed
    // For now, just indicate success in logs
    Debug("Text display completed: " + text + "\r\n");
}

void reportDeviceStatus(const char *status, float batteryVoltage, int signalStrength)
{
    Debug("Reporting device status: " + String(status) + "\r\n");

    DynamicJsonDocument doc(1024);
    doc["deviceId"] = DEVICE_ID;

    JsonObject statusObj = doc.createNestedObject("status");
    statusObj["status"] = status;
    statusObj["batteryVoltage"] = batteryVoltage;
    statusObj["signalStrength"] = signalStrength;
    statusObj["firmwareVersion"] = FIRMWARE_VERSION;
    statusObj["bootCount"] = bootCount;
    statusObj["freeHeap"] = ESP.getFreeHeap();
    statusObj["uptime"] = millis();

    String jsonString;
    serializeJson(doc, jsonString);

    String response;
    if (makeHttpRequest(STATUS_URL, "POST", jsonString, response))
    {
        Debug("Device status reported successfully\r\n");
        
        // Try to flush any buffered messages when we have connectivity
        if (bufferCount > 0)
        {
            flushOfflineBuffer();
        }
    }
    else
    {
        Debug("Device status reporting failed, buffering...\r\n");
        bufferMessage("device-status", jsonString);
    }
}

void sendLogToServer(const char *message, const char *level)
{
    Debug("Sending log: " + String(message) + "\r\n");

    DynamicJsonDocument doc(1024);
    doc["deviceId"] = DEVICE_ID;
    doc["logs"] = message;
    doc["logLevel"] = level;
    doc["deviceTime"] = millis();

    String jsonString;
    serializeJson(doc, jsonString);

    String response;
    String logsUrl = String(API_BASE_URL) + "logs";
    
    if (makeHttpRequest(logsUrl, "POST", jsonString, response, BASE_TIMEOUT))
    {
        Debug("Log sent successfully\r\n");
    }
    else
    {
        // Don't buffer logs if we're already having connectivity issues to avoid infinite recursion
        if (commState.consecutiveFailures < 2)
        {
            bufferMessage("logs", jsonString);
        }
    }
}

float readBatteryVoltage()
{
    // Read battery voltage from analog pin
    int adcReading = analogRead(BATTERY_PIN);

    // Convert ADC reading to voltage (3.3V reference, 12-bit ADC)
    // Assuming voltage divider if needed
    float voltage = (adcReading / 4095.0) * 3.3 * 2.0; // *2.0 if using voltage divider

    return voltage;
}

void enterDeepSleep(uint64_t sleepTime)
{
    Debug("Entering deep sleep for " + String(sleepTime / 1000000) + " seconds\r\n");

    // Configure timer wake-up
    esp_sleep_enable_timer_wakeup(sleepTime);

    // Enter deep sleep
    esp_deep_sleep_start();
}

bool checkForCommands()
{
    Debug("Checking for pending commands...\r\n");

    String commandsUrl = String(API_BASE_URL) + "commands/" + DEVICE_ID;
    String response;
    bool shouldStayAwake = false;

    if (makeHttpRequest(commandsUrl, "GET", "", response))
    {
        Debug("Commands response received\r\n");

        // Parse JSON response
        DynamicJsonDocument doc(4096);
        DeserializationError error = deserializeJson(doc, response);

        if (!error)
        {
            JsonArray commands = doc["commands"];
            
            if (commands.size() > 0)
            {
                Debug("Found " + String(commands.size()) + " pending commands\r\n");
                
                for (JsonObject command : commands)
                {
                    String cmd = command["command"];
                    unsigned long duration = command["duration"];
                    
                    Debug("Processing command: " + cmd + "\r\n");
                    processCommand(cmd, duration);
                    
                    // If any command is "stay_awake", we should stay awake
                    if (cmd == "stay_awake")
                    {
                        shouldStayAwake = true;
                    }
                }
            }
            else
            {
                Debug("No pending commands\r\n");
            }
        }
        else
        {
            Debug("JSON parsing error: " + String(error.c_str()) + "\r\n");
        }
    }
    else
    {
        Debug("Commands check failed - server not reachable\r\n");
    }

    return shouldStayAwake;
}

void processCommand(const String &command, unsigned long duration)
{
    Debug("Processing command: " + command + " (duration: " + String(duration) + "ms)\r\n");
    
    if (command == "stay_awake")
    {
        sendLogToServer(("Stay awake command received - duration: " + String(duration/1000) + "s").c_str());
        // The stay awake logic is handled in the main loop
    }
    else if (command == "update_now" || command == "force_update")
    {
        sendLogToServer("Force update command received - refreshing display");
        
        // Re-initialize display if needed
        EPD_13IN3E_Init();
        delay(1000);
        
        // Force fetch current image
        bool updated = fetchCurrentImage();
        
        if (updated)
        {
            sendLogToServer("Forced display update completed successfully");
        }
        else
        {
            sendLogToServer("Forced display update completed (no changes)", "WARN");
        }
        
        // Power down display
        EPD_13IN3E_Sleep();
    }
    else if (command == "enable_streaming")
    {
        sendLogToServer("Serial streaming enable command received");
        enableSerialStreaming();
    }
    else if (command == "disable_streaming")
    {
        sendLogToServer("Serial streaming disable command received");
        disableSerialStreaming();
    }
    else
    {
        sendLogToServer(("Unknown command received: " + command).c_str(), "WARN");
    }
}

// Enhanced communication functions for robustness

bool makeHttpRequest(const String &url, const String &method, const String &payload, String &response, int customTimeout)
{
    int timeout = customTimeout > 0 ? customTimeout : commState.adaptiveTimeout;
    
    for (int attempt = 0; attempt < MAX_RETRY_ATTEMPTS; attempt++)
    {
        HTTPClient http;
        http.begin(url);
        http.setTimeout(timeout);
        http.addHeader("Content-Type", "application/json");
        http.addHeader("User-Agent", "ESP32-Glance-Client/" FIRMWARE_VERSION);
        
        int httpResponseCode;
        if (method == "POST")
        {
            httpResponseCode = http.POST(payload);
        }
        else
        {
            httpResponseCode = http.GET();
        }
        
        if (httpResponseCode == 200 || httpResponseCode == 201)
        {
            response = http.getString();
            http.end();
            updateCommState(true);
            return true;
        }
        else if (httpResponseCode > 0)
        {
            Debug("HTTP request failed with code: " + String(httpResponseCode) + " (attempt " + String(attempt + 1) + ")\r\n");
        }
        else
        {
            Debug("HTTP request failed: " + http.errorToString(httpResponseCode) + " (attempt " + String(attempt + 1) + ")\r\n");
        }
        
        http.end();
        
        if (attempt < MAX_RETRY_ATTEMPTS - 1)
        {
            adaptiveDelay(1000 * (attempt + 1)); // Exponential backoff
        }
    }
    
