CHaerem/Glance/esp32-client/src/main.cpp
        String jsonString;
        serializeJson(doc, jsonString);
        bufferMessage("serial-stream", jsonString);
    }
}

void captureSerialOutput(const String &output)
{
    if (!serialStream.streamingEnabled) return;
    
    // Add to buffer
    serialStream.buffer += output;
    
    // If buffer is getting full or enough time has passed, flush it
    if (serialStream.buffer.length() >= SERIAL_STREAM_MIN_CHARS ||
        (serialStream.buffer.length() > 0 && 
         millis() - serialStream.lastStreamTime >= SERIAL_STREAM_INTERVAL))
    {
        flushSerialStream();
    }
}

void flushSerialStream()
{
    if (!serialStream.streamingEnabled || serialStream.buffer.length() == 0) return;
    
    DynamicJsonDocument doc(2048);
    doc["deviceId"] = DEVICE_ID;
    doc["serialOutput"] = serialStream.buffer;
    doc["timestamp"] = millis();
    doc["bufferSize"] = serialStream.buffer.length();
    
    String jsonString;
    serializeJson(doc, jsonString);
    
    String response;
    String streamUrl = String(API_BASE_URL) + "serial-stream";
    
    if (makeHttpRequest(streamUrl, "POST", jsonString, response, BASE_TIMEOUT))
    {
        // Successfully streamed, clear buffer
        serialStream.buffer = "";
        serialStream.lastStreamTime = millis();
    }
    else
    {
        // Failed to stream, keep buffer but prevent it from growing too large
        if (serialStream.buffer.length() > SERIAL_STREAM_BUFFER_SIZE)
        {
            // Keep only the last half of the buffer to prevent memory issues
            int keepLength = SERIAL_STREAM_BUFFER_SIZE / 2;
            serialStream.buffer = serialStream.buffer.substring(serialStream.buffer.length() - keepLength);
        }
    }
}

// Custom debug write function that captures output for streaming
size_t debugWrite(const uint8_t *buffer, size_t size)
{
    // Write to serial as normal
    size_t written = Serial.write(buffer, size);
    
    // If streaming is enabled and we have good connectivity, capture the output
    if (serialStream.streamingEnabled && isServerReachable())
    {
        String output = "";
        for (size_t i = 0; i < size; i++)
        {
            output += (char)buffer[i];
        }
        captureSerialOutput(output);
    }
    
    return written;
}